Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བམ་པོ་སུམ་ཅུ་གཅིག་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ལ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་བ་དང་།
en: Those lord buddhas who are alive at present in the world systems of the ten directions will indeed always guard, shelter, and nurture without interruption those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom.

source: བསྐྱབ་པ་དང་། བསྐྱང་བར་མཛད་དེ་དེ་ནི་མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་སྤངས་ཤིང་། དགེ་བའི་ཆོས་རྣམས་རྣམ་པར་འཕེལ་བར་འགྱུར་ཏེ་དེ་ལྟར་མི་དམིགས་པའི་ཚུལ་གྱིས།
en: Those [sons and daughters] will abandon nonvirtuous attributes and their virtuous attributes will prosper.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ་མི་དམིགས་པའི་ཚུལ་གྱིས།
en: By way of not apprehending anything, they will prosper and not decline due to the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: By way of not apprehending anything, they will prosper and not decline due to the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་ནང་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི། ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: By way of not apprehending anything, they will prosper and not decline due to the emptiness of internal phenomena.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི། ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: By way of not apprehending anything, they will prosper and not decline due to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི། ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: By way of not apprehending anything, they will prosper and not decline due to the applications of mindfulness.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: By way of not apprehending anything, they will prosper and not decline due to the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་རྣམ་པར་འཕེལ་བར་འགྱུར་གྱི།
en: By way of not apprehending anything, they will prosper and not decline due to the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience. “

source: ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ། །དེའི་ཚིག་བླང་བར་འོས་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཚིག་རན་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཚིག་འཆལ་པ་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཁྲོ་བས་ཟིལ་གྱིས་ནོན་པ་མེད་པར་འགྱུར་རོ།
en: They will be endowed with agreeable speech, they will be endowed with measured speech, they will be endowed with coherent speech, they will not be overpowered by anger, they will not be overpowered by pride, and they will not become miserly or envious.

source: །ང་རྒྱལ་གྱིས་ཟིལ་གྱིས་ནོན་པ་མེད་པར་འགྱུར་རོ། །སེར་སྣ་ཅན་དང་ཕྲག་དོག་ཅན་དུ་མི་འགྱུར་རོ། །བདག་ཀྱང་སྲོག་གཅོད་པ་སྤོང་བར་འགྱུར་རོ། །གཞན་ཡང་སྲོག་གཅོད་པ་སྤོང་བ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར་རོ།
en: They themselves will abstain from killing, and, in addition, they will genuinely encourage others to abstain from killing.

source: །སྲོག་གཅོད་པ་སྤོང་བའི་ལེགས་པ་རྗོད་པར་འགྱུར་རོ། །གཞན་གྱིས་སྲོག་གཅོད་པ་སྤངས་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise abstention from killing and they will praise and rejoice with others when they abstain from killing.

source: །བདག་ཀྱང་མ་བྱིན་པར་ལེན་པ་དང་།
en: They themselves will abstain from stealing, {Ki.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་ཕྲ་མ་དང་ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་ཆགས་སེམས་དང་། གནོད་སེམས་དང་ལོག་པར་ལྟ་བ་སྤངས་བར་འགྱུར། གཞན་ཡང་ལོག་པར་ལྟ་བ་སྤོང་བ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: II-III: 46} sexual misconduct, falsehood, slander, verbal abuse, irresponsible chatter, covetousness, malice, and wrong views, and, in addition, they will genuinely encourage others to abstain from wrong views [and so forth].

source: ལོག་པར་ལྟ་བ་སྤོང་བའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་གྱིས་ལོག་པར་ལྟ་བ་སྤོངས་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་བརྗེས་སུ་དགའ་བར་འགྱུར་རོ། །བདག་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཇུག་པར་འགྱུར།
en: They will praise abstention from wrong views [and so forth], and they will praise and rejoice with others when they abstain from wrong views [and so forth]. {

source: གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: Ki.II-III: 47} “They themselves will engage in the perfection of generosity, and, in addition, they will genuinely encourage others to engage in the perfection of generosity.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the perfection of generosity and they will also praise and rejoice with others when they engage in the perfection of generosity.

source: །བདག་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཇུག་པར་འགྱུར་རོ།
en: They themselves will engage in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and, in addition, they will genuinely encourage others to engage in the perfection of wisdom [and so forth].

source: །གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the perfection of wisdom [and so forth], and they will also praise and rejoice with others when they engage in the perfection of wisdom [and so forth]. “

source: །བདག་ཀྱང་ནང་སྟོང་པ་ཉིད་སྒོམ་པར་འགྱུར། གཞན་ཡང་ནང་སྟོང་པ་ཉིད་སྒོམ་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will cultivate the emptiness of internal phenomena, and, in addition, they will genuinely encourage others to cultivate the emptiness of internal phenomena.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་ནང་སྟོང་པ་ཉིད་སྒོམ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ། །བདག་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་པར་འགྱུར།
en: They will praise the emptiness of internal phenomena and they will also praise and rejoice with others when they cultivate the emptiness of internal phenomena. {

source: གཞན་ཡང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: Ki.II-III:48} They themselves will cultivate [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and, in addition, they will genuinely encourage others to cultivate the emptiness of the essential nature of nonentities [and so forth].

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་སྒོམ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the emptiness of the essential nature of nonentities [and so forth], and they will also praise and rejoice with others when they cultivate the emptiness of the essential nature of nonentities [and so forth]. “

source: །བདག་ཀྱང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་པར་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in all the meditative stabilities, and, in addition, they will genuinely encourage others to be absorbed in all the meditative stabilities.

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise absorption in all the meditative stabilities, and they will also praise and rejoice with others when they are absorbed in all the meditative stabilities. “

source: །བདག་ཀྱང་གཟུངས་རྣམས་ཐོབ་པར་འགྱུར། གཞན་ཡང་གཟུངས་རྣམས་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will attain the dhāraṇīs, and, in addition, they will genuinely encourage others to attain the dhāraṇīs.

source: གཟུངས་རྣམས་ཐོབ་པར་བྱེད་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་གྱིས་གཟུངས་རྣམས་ཐོབ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the attaining of the dhāraṇīs, and they will also praise and rejoice with others when they attain the dhāraṇīs. “

source: །བདག་ཀྱང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་བསམ་གཏན་དང་པོ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in the first meditative concentration, and, in addition, they will genuinely encourage others to be absorbed in the first meditative concentration.

source: བསམ་གཏན་དང་པོའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the first meditative concentration and they will also praise and rejoice with others when they are absorbed in the first meditative concentration.

source: །བདག་ཀྱང་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་བསམ་གཏན་བཞི་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in the second, third, and fourth meditative concentrations, and, in addition, they will genuinely encourage others to be absorbed in the fourth meditative concentration [and so forth].

source: བསམ་གཏན་བཞི་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the fourth meditative concentration [and so forth], and they will also praise and rejoice with others when they are absorbed in the fourth meditative concentration [and so forth]. “

source: །བདག་ཀྱང་བྱམས་པ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་བྱམས་པ་ལ་སྙོམས་པར་འཇུག་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in loving kindness, and, in addition, they will genuinely encourage others to be absorbed in loving kindness.

source: བྱམས་པ་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་བྱམས་པ་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the absorption in loving kindness and they will also praise and rejoice with others when they are absorbed in loving kindness. {Ki.

source: །བདག་ཀྱང་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: II-III: 49} They themselves will be absorbed in compassion, empathetic joy, and equanimity, and, in addition, they will genuinely encourage others to be absorbed in equanimity [and so forth].

source: བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།།
en: They will praise the absorption in equanimity [and so forth], and they will also praise and rejoice with others when they are absorbed in equanimity [and so forth]. “

source: བདག་ཀྱང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པར་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in the sphere of infinite space, and, in addition, they will genuinely encourage others to be absorbed in the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the absorption in the sphere of infinite space and they will also praise and rejoice with others when they are absorbed in the sphere of infinite space.

source: །བདག་ཀྱང་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པར་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, and, in addition, they will genuinely encourage others to be absorbed in the sphere of neither perception nor nonperception [and so forth].

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the absorption in the sphere of neither perception nor nonperception [and so forth], and they will also praise and rejoice with others when they are absorbed in the sphere of neither perception nor nonperception [and so forth]. “

source: །བདག་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པར་འགྱུར། གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will cultivate the applications of mindfulness, and, in addition, they will genuinely encourage others to cultivate the applications of mindfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ། །བདག་ཀྱང་ཡང་དག་པར་སྤོང་བ་དང་།
en: They will praise the cultivation of the applications of mindfulness and they will also praise and rejoice with others when they cultivate the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་བསྒོམ་པར་འགྱུར།
en: They themselves will cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and, in addition, they will genuinely encourage others to cultivate the noble eightfold path [and so forth].

source: གཞན་ཡང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་ན་ཡང་དེ་དག་གི་ལེགས་བརྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the cultivation of the noble eightfold path [and so forth], and they will also praise and rejoice with others when they cultivate the noble eightfold path [and so forth]. “

source: །བདག་ཀྱང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་སྒོམ་པར་འགྱུར། གཞན་ཡང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: They themselves will cultivate the meditative stabilities of emptiness, signlessness, and wishlessness, and, in addition, they will genuinely encourage others to cultivate the meditative stabilities of emptiness, signlessness, and wishlessness.

source: སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: They will praise the meditative stabilities of emptiness, signlessness, and wishlessness, and they will also praise and rejoice with others when they cultivate the meditative stabilities of emptiness, signlessness, and wishlessness. {

source: སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་སྒོམ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: Ki.

source: །བདག་ཀྱང་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་འཐུན་པར་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། རྣམ་པར་ཐར་པ་བརྒྱད་ཀྱི་ལེགས་པ་རྗོད་པར་འགྱུར།
en: II-III: 50} “They themselves will be absorbed in the eight aspects of liberation, both consecutively and in reverse order, and, in addition, they will genuinely encourage others to be absorbed in the eight aspects of liberation.

source: གཞན་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་ལུགས་དང་མཐུན་པ་དང་། ལུགས་དང་མི་མཐུན་པར་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the eight aspects of liberation and they will also praise and rejoice with others when they are absorbed in the eight aspects of liberation, both consecutively and in reverse order. “

source: །བདག་ཀྱང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པར་ཡང་དག་པར་སྐུལ་བར་འགྱུར། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའི་ལེགས་པ་རྗོད་པར་འགྱུར།
en: They themselves will be absorbed in the nine serial steps of meditative absorption, and, in addition, they will genuinely encourage others to be absorbed in the nine serial steps of meditative absorption.

source: གཞན་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the nine serial steps of meditative absorption and they will also praise and rejoice with others when they are absorbed in the nine serial steps of meditative absorption. “

source: །བདག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར།
en: They themselves will be absorbed in the ten powers of the tathāgatas, and, in addition, they will genuinely encourage others to be absorbed in the ten powers of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སྙོམས་པར་འཇུག་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise the ten powers of the tathāgatas and they will also praise and rejoice with others when they are absorbed in the ten powers of the tathāgatas. “

source: །བདག་ཀྱང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་པར་འགྱུར།
en: They themselves will attain the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and, in addition, they will genuinely encourage others to attain the eighteen distinct qualities of the buddhas [and so forth].

source: གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་པ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་པའི་ལེགས་པ་རྗོད་པར་འགྱུར། གཞན་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ། །བདག་ཀྱང་ཡོངས་སུ་མི་ཉམ་པའི་ཆོས་དང་།
en: They will praise the attaining of the eighteen distinct qualities of the buddhas [and so forth], and they will also praise and rejoice with others when they attain the eighteen distinct qualities of the buddhas [and so forth]. “

source: རྟག་ཏུ་བཏང་སྙོམས་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར། གཞན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་སྐུལ་བར་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལེགས་པ་རྗོད་པར་འགྱུར།
en: They themselves will attain the unfailing attributes, perpetual equanimity, knowledge of the path, and all-aspect omniscience, and, in addition, they will genuinely encourage others to attain all-aspect omniscience [and so forth].

source: གཞན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་ན་ཡང་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ།
en: They will praise all-aspect omniscience [and so forth], and they will also praise and rejoice with others when they attain all-aspect omniscience [and so forth]. “

source: །དེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། མི་དམིགས་པའི་ཚུལ་གྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་འགྱུར་རོ།
en: When they practice the six perfections, whatever gifts they dispense, they dedicate to unsurpassed, complete enlightenment, making common cause with all beings, and without apprehending anything.

source: །ཚུལ་ཁྲིམས་སྲུང་བ་དང་།
en: Whatever ethical discipline they guard, {Ki.

source: བཟོད་པ་སྒོམ་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་། བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་སྒོམ་ཡང་དེ་དག་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། མི་དམིགས་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་འགྱུར་རོ།
en: II-III: 51} whatever tolerance they cultivate, whatever perseverance they undertake, whatever meditative concentration they are absorbed in, and whatever wisdom they cultivate, they dedicate all these to unsurpassed, complete enlightenment, making common cause with all beings, and without apprehending anything. “

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། དྲན་པ་སྐྱེ་བར་འགྱུར་ཏེ། གལ་ཏེ་བདག་གིས་སྦྱིན་པ་མ་བཏང་ན་ངན་སོང་གི་རྒྱུད་དུ་སྐྱེ་བར་འགྱུར་ཏེ། བདག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་མི་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཡང་མི་འགྱུར།
en: When noble sons or noble daughters practice the six perfections in that manner, the following recollection arises: ‘If I do not dispense gifts, I will be reborn in the series of lower existences, I will not bring beings to maturation, I will not refine the buddhafields, and indeed I will not attain all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར་རོ། །གལ་ཏེ་བདག་གིས་ཚུལ་ཁྲིམས་མ་བསྲུངས་ན་ངན་སོང་གསུམ་དུ་སྐྱེ་བར་འགྱུར་ཏེ། མིའི་ལུས་འཐོབ་པར་ཡང་མི་འགྱུར། བདག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་མི་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཡང་མི་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར་རོ།
en: If I do not maintain ethical discipline, I will be reborn in the three lower existences, I will not even acquire a human body, I will not bring beings to maturation, I will not refine the buddhafields, and indeed I will not attain all-aspect omniscience.

source: །གལ་ཏེ་བདག་གིས་བཟོད་པ་མ་བསྒོམས་ན། བདག་གིས་དབང་པོ་རྣམས་ཀྱང་ཉམས་པར་འགྱུར། བདག་གི་བཞིན་གྱི་དཀྱིལ་འཁོར་ཡང་གཟི་མེད་པར་འགྱུར། གཟུགས་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་པར་མི་འགྱུར་ཏེ།
en: If I do not cultivate tolerance, I will have diminished faculties, my facial complexion will become lackluster, and I will not acquire an excellent physique.

source: གཟུགས་ཕུན་སུམ་ཚོགས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གདོན་མི་ཟ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཡང་མེད་པར་འགྱུར་ཏེ།
en: That is to say, when I practice the conduct of a bodhisattva, I will lack an excellent form such as that which without a doubt, as soon as they see it, will turn beings toward unsurpassed, complete enlightenment.

source: གཟུགས་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་མི་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཡང་མྱི་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར་རོ།
en: I will not bring beings to maturation through an excellent form, I will not refine the buddhafields, and indeed I will not attain all-aspect omniscience.

source: །གལ་ཏེ་ལེ་ལོར་གྱུར་ན་བདག་གིས་བྱང་ཆུབ་ཀྱི་ལམ་ཐོབ་པར་ཡང་མི་ནུས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་མི་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཡང་མི་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར་རོ།
en: If I am indolent, I cannot attain the path to enlightenment, I will not bring beings to maturation, I will not refine the buddhafields, and indeed I will not attain all-aspect omniscience.
